Repository: Rudra-ravi/swiftsave-app
Catalog: lib/l10n/app_*.arb
Languages: hi

# enterUrl
source: Enter Video URL
hi: वीडियो URL दर्ज करें

# fetchInfo
source: Fetch Video Info
hi: वीडियो जानकारी प्राप्त करें

source: Download Video
hi: वीडियो डाउनलोड करें

# downloadAudio
source: Download Audio Only
hi: ऑडियो डाउनलोड करें

source: Downloading...
hi: डाउनलोड हो रहा है...

source: Completed
hi: पूरा हुआ

source: Error
hi: त्रुटि

# queue
source: Download Queue
hi: डाउनलोड कतार

source: Playlist
hi: प्लेलिस्ट

source: Settings
hi: सेटिंग्स

source: Theme
hi: थीम

source: Language
hi: भाषा

# systemTheme
source: System Default
hi: सिस्टम डिफ़ॉल्ट

# lightTheme
source: Light Mode
hi: लाइट मोड

# darkTheme
source: Dark Mode
hi: डार्क मोड

# bestQuality
source: Best Quality (Recommended)
hi: सर्वोत्तम गुणवत्ता (अनुशंसित)

source: Audio Only
hi: केवल ऑडियो

source: Video Formats
hi: वीडियो प्रारूप

# storagePermissionRequired
source: Storage permission is required to download videos
hi: वीडियो डाउनलोड करने के लिए स्टोरेज अनुमति आवश्यक है

source: Download started
hi: डाउनलोड शुरू हुआ

source: Download completed
hi: डाउनलोड पूरा हुआ

source: Download failed
hi: डाउनलोड विफल

# noFormats
source: No formats found
hi: कोई प्रारूप नहीं मिला

source: Paste Link
hi: लिंक पेस्ट करें

source: Clear
hi: साफ़ करें

source: Processing...
hi: प्रक्रिया जारी है...

source: Cancel
hi: रद्द करें

source: Retry
hi: पुनः प्रयास करें

source: Remove
hi: हटाएं

source: Play
hi: चलाएं

source: Pause
hi: रोकें

source: Open File
hi: फ़ाइल खोलें

source: Recent Links
hi: हाल के लिंक

source: Supported Sites
hi: समर्थित साइटें

# searchDownloads
source: Search
hi: खोजें

# filterAll
source: All
hi: सभी

# filterActive
source: Active
hi: सक्रिय

# filterErrors
source: Errors
hi: त्रुटियाँ

source: Downloads
hi: डाउनलोड

source: Wi-Fi only downloads
hi: केवल Wi-Fi पर डाउनलोड

source: Save to Gallery
hi: गैलरी में सहेजें

source: Max concurrent downloads
hi: अधिकतम समवर्ती डाउनलोड

source: Download location
hi: डाउनलोड स्थान

source: Waiting for Wi-Fi
hi: Wi-Fi के लिए प्रतीक्षा

source: Retry all
hi: सभी पुनः प्रयास करें

source: No results
hi: कोई परिणाम नहीं

source: No downloads yet
hi: अभी तक कोई डाउनलोड नहीं

# addVideosToStart
source: Add videos to start downloading
hi: डाउनलोड शुरू करने के लिए वीडियो जोड़ें

source: Cancel Download?
hi: डाउनलोड रद्द करें?

# cancelDownloadMessage
source: Are you sure you want to cancel this download?
hi: क्या आप वाकई इस डाउनलोड को रद्द करना चाहते हैं?

source: Image unavailable
hi: छवि उपलब्ध नहीं

# invalidUrl
source: Please enter a valid URL
hi: कृपया एक वैध URL दर्ज करें

source: Gallery
hi: गैलरी

# galleryItems
source: {count} items
hi: {count} आइटम

source: Download All
hi: सभी डाउनलोड करें

source: Select Items
hi: आइटम चुनें

# chooseItemsToDownload
source: Choose which items to download
hi: डाउनलोड करने के लिए आइटम चुनें

source: Download Gallery
hi: गैलरी डाउनलोड करें

source: Download Image
hi: छवि डाउनलोड करें

# downloadAudioFile
source: Download Audio
hi: ऑडियो डाउनलोड करें

source: Add to Queue
hi: कतार में जोड़ें

source: About
hi: के बारे में

# builtWithFlutter
source: Built with Flutter & Python
hi: Flutter और Python के साथ बनाया गया

source: Powered by yt-dlp
hi: yt-dlp द्वारा संचालित

source: Initialization Error
hi: प्रारंभीकरण त्रुटि

# servicesFailed
source: Some services failed to start
hi: कुछ सेवाएं शुरू होने में विफल रहीं

source: Continue Anyway
hi: फिर भी जारी रखें

# addedVideosToQueue
source: Added {count} videos to queue
hi: कतार में {count} वीडियो जोड़े गए

source: Best available video
hi: उपलब्ध सर्वोत्तम वीडियो

source: Fallback to best
hi: सर्वोत्तम पर वापस जाएं

source: Progressive format
hi: प्रोग्रेसिव फ़ॉर्मेट

source: Smaller file, audio only
hi: छोटी फ़ाइल, केवल ऑडियो

source: Hide advanced
hi: उन्नत छुपाएँ

source: Advanced
hi: उन्नत

source: Clear errors
hi: त्रुटियाँ साफ़ करें

# removedErrors
source: Removed {count} errors
hi: {count} त्रुटियाँ हटाई गईं

source: Sort
hi: क्रमबद्ध करें

# sortNewest
source: Newest
hi: नवीनतम

# sortOldest
source: Oldest
hi: पुराना

# sortStatus
source: Status
hi: स्थिति

# enableSetting
source: On
hi: चालू

# disableSetting
source: Off
hi: बंद

# downloadAnyNetwork
source: Downloads on any network
hi: किसी भी नेटवर्क पर डाउनलोड

# defaultDownloadPath
source: Use app default folder
hi: डिफ़ॉल्ट फ़ोल्डर का उपयोग करें

# cookieSettings
source: Cookie session
hi: कुकी सत्र

# cookiesActive
source: Cookies active ({browser})
hi: कुकी सक्रिय ({browser})

# cookiesImported
source: Imported cookies from {browser}
hi: {browser} से कुकी आयात की गई

# cookiesImportFailed
source: Failed to import cookies from {browser}
hi: {browser} से कुकी आयात विफल

source: Unknown browser
hi: अज्ञात ब्राउज़र

source: No cookies imported
hi: कोई कुकी आयात नहीं हुई

source: Import browser cookies
hi: ब्राउज़र कुकी आयात करें

source: Clear cookies
hi: कुकी साफ़ करें

source: Cookies cleared
hi: कुकी साफ़ हो गईं

source: Advanced Settings
hi: उन्नत सेटिंग्स

# advancedSettingsSubtitle
source: Quality, concurrent downloads, proxy...
hi: गुणवत्ता, समवर्ती डाउनलोड, प्रॉक्सी...

# downloadPathHelper
source: Leave empty to use default
hi: डिफ़ॉल्ट उपयोग के लिए खाली छोड़ें

# resetToDefault
source: Reset
hi: रीसेट

# saveSetting
source: Save
hi: सहेजें

source: Waiting in queue...
hi: कतार में प्रतीक्षा...

source: Cancelled
hi: रद्द किया गया

# itemsProgress
source: {current}/{total} items
hi: {current}/{total} आइटम

# buttonPasteLink
source: Paste a Link
hi: लिंक पेस्ट करें

# buttonDownload
source: Download
hi: डाउनलोड

# buttonGettingInfo
source: Getting info...
hi: जानकारी ले रहे हैं...

# buttonDoneTap
source: Done! Tap to open
hi: हो गया! खोलने के लिए टैप करें

# buttonTryAgain
source: Try Again
hi: पुनः प्रयास करें

# progressStarting
source: Starting...
hi: शुरू हो रहा है...

# progressDownloading
source: Downloading...
hi: डाउनलोड हो रहा है...

# progressGettingThere
source: Getting there...
hi: आगे बढ़ रहा है...

# progressHalfway
source: Halfway!
hi: आधा हो गया!

# progressAlmostDone
source: Almost done!
hi: लगभग पूरा!

# progressFinishing
source: Finishing up...
hi: समाप्त हो रहा है...

# advMaxQualityWifi
source: Max Quality (WiFi)
hi: अधिकतम गुणवत्ता (WiFi)

# advMaxQualityMobile
source: Max Quality (Mobile)
hi: अधिकतम गुणवत्ता (मोबाइल)

# advSimultaneousDownloads
source: Simultaneous Downloads
hi: एक साथ डाउनलोड

# advAtATime
source: {count} at a time
hi: एक बार में {count}

# advDownloadDelay
source: Download Delay
hi: डाउनलोड विलंब

# advNoDelay
source: No delay
hi: कोई विलंब नहीं

# advSeconds
source: {count} seconds
hi: {count} सेकंड

# advFragmentsPerDownload
source: Fragments per Download
hi: प्रति डाउनलोड फ्रैगमेंट

# advCustomUserAgent
source: Custom User-Agent
hi: कस्टम User-Agent

# advDefaultUserAgent
source: Use default yt-dlp user-agent
hi: डिफ़ॉल्ट yt-dlp user-agent उपयोग करें

# advProxyUrl
source: Proxy URL
hi: प्रॉक्सी URL

# advNoProxy
source: No proxy configured
hi: कोई प्रॉक्सी नहीं

# advSkipDuplicates
source: Skip Duplicates
hi: डुप्लिकेट छोड़ें

# advSkipDuplicatesSub
source: Skip videos you already downloaded
hi: पहले से डाउनलोड किए गए वीडियो छोड़ें

# advAutoRetry
source: Auto-Retry Failed
hi: स्वचालित पुनः प्रयास

# advAutoRetrySub
source: Automatically retry failed downloads
hi: विफल डाउनलोड स्वचालित रूप से पुनः प्रयास करें

# advSaveToGallery
source: Save to Gallery
hi: गैलरी में सहेजें

# advSaveToGallerySub
source: Show downloads in your gallery app
hi: डाउनलोड को गैलरी ऐप में दिखाएं

# advEmbedSubtitles
source: Embed Subtitles
hi: उपशीर्षक एम्बेड करें

# advEmbedSubtitlesSub
source: Embed subtitle track into supported video formats
hi: समर्थित वीडियो प्रारूपों में उपशीर्षक एम्बेड करें

# advSubtitleLanguage
source: Subtitle Language
hi: उपशीर्षक भाषा

# advSectionQuality
source: Quality
hi: गुणवत्ता

# advSectionPerformance
source: Performance
hi: प्रदर्शन

# advSectionNetwork
source: Network
hi: नेटवर्क

# advSectionBehavior
source: Behavior
hi: व्यवहार

# advSectionSubtitles
source: Subtitles
hi: उपशीर्षक

# advFfmpegChecking
source: Checking...
hi: जाँच हो रही है...

# advFfmpegBestQuality
source: v{version} - Best quality enabled
hi: v{version} - सर्वोत्तम गुणवत्ता सक्षम

# advFfmpegPremerged
source: Using pre-merged formats
hi: प्री-मर्ज्ड प्रारूप उपयोग में

# advNotEnoughStorage
source: Not enough storage
hi: पर्याप्त स्टोरेज नहीं

# advStorageMessage
source: Available: {available} Required: {required} Free up space and try again.
hi: उपलब्ध: {available} आवश्यक: {required} स्थान खाली करें और पुनः प्रयास करें।

# toolsTab
source: Tools
hi: टूल्स

# toolsManagerTitle
source: Tool Manager
hi: टूल मैनेजर

source: Install tools
hi: टूल इंस्टॉल करें

source: Update tools
hi: टूल अपडेट करें

source: Repair tools
hi: टूल रिपेयर करें

source: Tools ready
hi: टूल तैयार हैं

source: Tools missing
hi: टूल उपलब्ध नहीं

source: Last updated
hi: आख़िरी अपडेट

source: Versions
hi: संस्करण

# setupWizardTitle
source: Set up downloader tools
hi: डाउनलोड टूल सेटअप करें

# setupWizardDesc
source: Install yt-dlp and FFmpeg once to enable downloads on desktop platforms.
hi: डेस्कटॉप पर डाउनलोड सक्षम करने के लिए yt-dlp और FFmpeg एक बार इंस्टॉल करें।

source: Run setup
hi: सेटअप चलाएँ

# openToolsManager
source: Open Tool Manager
hi: टूल मैनेजर खोलें

source: Checking tools...
hi: टूल जाँच रहे हैं...
